# Category Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..Category Property
Element Class See Also
---
Retrieves a Category object that represents the category or sub category in which the element resides.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Category Category { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Category As Category
	Get
```

Visual C++
---
```text
public:
property Category^ Category {
	Category^ get ();
}
```

# Remarks
All category objects can be retrieved from the application by using the Categories property of the Application.Settings object.
# See Also
Element Class
Autodesk.Revit.DB Namespace